---
kind: type
id: T:Autodesk.Revit.DB.Visual.WoodPoreType
source: html/c63b0f9e-2a42-2419-6d4c-83b4567e1e9b.htm
---
# Autodesk.Revit.DB.Visual.WoodPoreType

The enumerated type representing the permitted values for the asset property "WoodPoreType" from the "AdvancedLayered" schema.

## Syntax (C#)
```csharp
public enum WoodPoreType
```